SijWoo/EmbeddedLinux-Guide/pinmux/M4F/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v7.0
processor: MCIMX7U5xxxxx
package_id: MCIMX7U5CVP05
mcu_data: ksdk2_0
processor_version: 7.0.1
board: MCIMX7ULP-EVK-REV-B
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
init_gpio_pins:
- options: {callFromInitBoot: 'false', coreID: cm4}
- pin_list:
  - {pin_num: AG16, peripheral: PTA, signal: 'port, 12', pin_signal: PTA12, direction: OUTPUT, OBE: OBE_1_Enabled}
  - {pin_num: AF16, peripheral: PTA, signal: 'port, 13', pin_signal: PTA13, direction: INPUT, IBE: IBE_1_Enabled}
  - {pin_num: AF17, peripheral: PTA, signal: 'port, 14', pin_signal: PTA14, direction: OUTPUT, OBE: OBE_1_Enabled}
  - {pin_num: AF18, peripheral: PTA, signal: 'port, 15', pin_signal: PTA15, direction: OUTPUT, OBE: OBE_1_Enabled}
  - {pin_num: AB20, peripheral: PTA, signal: 'port, 21', pin_signal: PTA21, direction: OUTPUT, OBE: OBE_1_Enabled}
  - {pin_num: AD20, peripheral: PTA, signal: 'port, 23', pin_signal: PTA23, direction: INPUT, IBE: IBE_1_Enabled}
  - {pin_num: AF20, peripheral: PTA, signal: 'port, 24', pin_signal: PTA24, direction: OUTPUT, OBE: OBE_1_Enabled}
  - {pin_num: AG20, peripheral: PTA, signal: 'port, 25', pin_signal: PTA25, direction: OUTPUT, OBE: OBE_1_Enabled}
  - {pin_num: AF14, peripheral: PTA, signal: 'port, 3', pin_signal: PTA3, direction: OUTPUT, OBE: OBE_1_Enabled}
  - {pin_num: AF24, peripheral: PTA, signal: 'port, 31', pin_signal: PTA31, direction: INPUT, IBE: IBE_1_Enabled}
  - {pin_num: AF5, peripheral: PTB, signal: 'port, 6', pin_signal: PTB6, direction: OUTPUT, OBE: OBE_1_Enabled}
  - {pin_num: AF6, peripheral: PTB, signal: 'port, 7', pin_signal: PTB7, direction: INPUT, IBE: IBE_1_Enabled}
  - {pin_num: AD7, peripheral: PTB, signal: 'port, 9', pin_signal: PTB9, direction: INPUT, IBE: IBE_1_Enabled}
  - {pin_num: AB7, peripheral: PTB, signal: 'port, 11', pin_signal: PTB11, direction: INPUT, IBE: IBE_1_Enabled}
  - {pin_num: D18, peripheral: PTC, signal: 'port, 0', pin_signal: PTC0, direction: OUTPUT, OBE: OBE_1_Enabled}
  - {pin_num: B15, peripheral: PTC, signal: 'port, 10', pin_signal: PTC10, direction: INPUT, IBE: IBE_1_Enabled, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
  - {pin_num: B14, peripheral: PTC, signal: 'port, 11', pin_signal: PTC11, direction: INPUT, IBE: IBE_1_Enabled}
  - {pin_num: A14, peripheral: PTC, signal: 'port, 12', pin_signal: PTC12, direction: INPUT, IBE: IBE_1_Enabled}
  - {pin_num: E13, peripheral: PTC, signal: 'port, 14', pin_signal: PTC14, direction: OUTPUT, OBE: OBE_1_Enabled}
  - {pin_num: F13, peripheral: PTC, signal: 'port, 15', pin_signal: PTC15, direction: OUTPUT, OBE: OBE_1_Enabled}
  - {pin_num: G12, peripheral: PTC, signal: 'port, 17', pin_signal: PTC17, direction: OUTPUT, OBE: OBE_1_Enabled}
  - {pin_num: F12, peripheral: PTC, signal: 'port, 18', pin_signal: PTC18, direction: INPUT, IBE: IBE_1_Enabled, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
  - {pin_num: E12, peripheral: PTC, signal: 'port, 19', pin_signal: PTC19, direction: OUTPUT, OBE: OBE_1_Enabled, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
  - {pin_num: B8, peripheral: PTE, signal: 'port, 12', pin_signal: PTE12, direction: OUTPUT, OBE: OBE_1_Enabled}
  - {pin_num: D2, peripheral: PTF, signal: 'port, 0', pin_signal: PTF0, direction: INPUT, IBE: IBE_1_Enabled}
  - {pin_num: B2, peripheral: PTF, signal: 'port, 1', pin_signal: PTF1, direction: OUTPUT, OBE: OBE_1_Enabled}
  - {pin_num: G5, peripheral: PTF, signal: 'port, 10', pin_signal: PTF10, direction: OUTPUT, OBE: OBE_1_Enabled}
  - {pin_num: G6, peripheral: PTF, signal: 'port, 11', pin_signal: PTF11, direction: OUTPUT, OBE: OBE_1_Enabled}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : init_gpio_pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void init_gpio_pins(void) {                                /*!< Function assigned for the core: Cortex-M4[cm4] */
    IOMUXC_SetPinMux(INIT_GPIO_PINS_BATT_ADC_EN_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_BATT_ADC_EN_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_OBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_VOL_DOWN_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_VOL_DOWN_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_IBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_WL_REG_ON_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_WL_REG_ON_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_OBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_BT_REG_ON_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_BT_REG_ON_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_OBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_M4_PER_EN_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_M4_PER_EN_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_OBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_AUD_INT_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_AUD_INT_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_IBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_AUD_PWR_EN_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_AUD_PWR_EN_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_OBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_A7_POW_EN_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_A7_POW_EN_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_OBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_VOL_UP_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_VOL_UP_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_OBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_WL_HOST_WAKE_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_WL_HOST_WAKE_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_IBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_PMIC_INT_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_PMIC_INT_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_IBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_DDR_SW_EN_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_DDR_SW_EN_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_OBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_BT_HOST_WAKE_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_BT_HOST_WAKE_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_IBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_SEN_INT_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_SEN_INT_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_IBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_USB_OTG_PWR_EN_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_USB_OTG_PWR_EN_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_OBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_SD0_CD_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_SD0_CD_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_IBE_MASK |
                        IOMUXC1_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC1_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_USB_CC_SEL_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_USB_CC_SEL_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_IBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_USB_INT_B_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_USB_INT_B_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_IBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_PTC14_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_PTC14_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_OBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_PTC15_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_PTC15_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_OBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_PTC17_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_PTC17_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_OBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_DSI_HDMI_INT_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_DSI_HDMI_INT_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_IBE_MASK |
                        IOMUXC1_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC1_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_MIPI_RESET_B_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_MIPI_RESET_B_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_OBE_MASK |
                        IOMUXC1_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC1_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_BT_DEV_WAKE_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_BT_DEV_WAKE_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_OBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_TOUCH_INT_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_TOUCH_INT_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_IBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_TOUCH_RST_B_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_TOUCH_RST_B_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_OBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_PTF10_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_PTF10_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_OBE_MASK);
    IOMUXC_SetPinMux(INIT_GPIO_PINS_PTF11_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_GPIO_PINS_PTF11_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_OBE_MASK);
}


