SijWoo/EmbeddedLinux-Guide/pinmux/M4F/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
init_i2s_pins:
- options: {callFromInitBoot: 'false', coreID: cm4}
- pin_list:
  - {pin_num: AG14, peripheral: I2S0, signal: 'i2s_rxd, 0', pin_signal: PTA2, DSE: DSE_1_Hi_Drive}
  - {pin_num: AD15, peripheral: I2S0, signal: i2s_mclk, pin_signal: PTA4, DSE: DSE_1_Hi_Drive}
  - {pin_num: AC15, peripheral: I2S0, signal: i2s_tx_bclk, pin_signal: PTA5, DSE: DSE_1_Hi_Drive}
  - {pin_num: AB15, peripheral: I2S0, signal: i2s_tx_fs, pin_signal: PTA6, DSE: DSE_1_Hi_Drive}
  - {pin_num: AD14, peripheral: I2S0, signal: 'i2s_txd, 0', pin_signal: PTA7, DSE: DSE_1_Hi_Drive}
  - {pin_num: AF2, peripheral: I2S1, signal: i2s_tx_bclk, pin_signal: PTB1, DSE: DSE_1_Hi_Drive}
  - {pin_num: AE3, peripheral: I2S1, signal: i2s_tx_fs, pin_signal: PTB2, DSE: DSE_1_Hi_Drive}
  - {pin_num: AE4, peripheral: I2S1, signal: 'i2s_txd, 0', pin_signal: PTB3, DSE: DSE_1_Hi_Drive}
  - {pin_num: AC7, peripheral: I2S1, signal: 'i2s_rxd, 0', pin_signal: PTB10, DSE: DSE_1_Hi_Drive}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : init_i2s_pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void init_i2s_pins(void) {                                 /*!< Function assigned for the core: Cortex-M4[cm4] */
    IOMUXC_SetPinMux(INIT_I2S_PINS_I2S0_RXD0_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2S_PINS_I2S0_RXD0_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_DSE_MASK);
    IOMUXC_SetPinMux(INIT_I2S_PINS_I2S0_MCLK_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2S_PINS_I2S0_MCLK_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_DSE_MASK);
    IOMUXC_SetPinMux(INIT_I2S_PINS_I2S0_TX_BCLK_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2S_PINS_I2S0_TX_BCLK_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_DSE_MASK);
    IOMUXC_SetPinMux(INIT_I2S_PINS_I2S0_TX_FS_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2S_PINS_I2S0_TX_FS_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_DSE_MASK);
    IOMUXC_SetPinMux(INIT_I2S_PINS_I2S0_TXD0_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2S_PINS_I2S0_TXD0_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_DSE_MASK);
    IOMUXC_SetPinMux(INIT_I2S_PINS_I2S1_TX_BCLK_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2S_PINS_I2S1_TX_BCLK_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_DSE_MASK);
    IOMUXC_SetPinMux(INIT_I2S_PINS_I2S1_RXD0_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2S_PINS_I2S1_RXD0_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_DSE_MASK);
    IOMUXC_SetPinMux(INIT_I2S_PINS_I2S1_TX_FS_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2S_PINS_I2S1_TX_FS_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_DSE_MASK);
    IOMUXC_SetPinMux(INIT_I2S_PINS_I2S1_TXD0_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2S_PINS_I2S1_TXD0_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_DSE_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
init_uart_pins:
- options: {callFromInitBoot: 'false', coreID: cm4}
- pin_list:
  - {pin_num: AB16, peripheral: LPUART2, signal: lpuart_cts_b, pin_signal: PTA8, identifier: UART2_CTS, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
  - {pin_num: AC16, peripheral: LPUART2, signal: lpuart_rts_b, pin_signal: PTA9, identifier: UART2_RTS, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
  - {pin_num: AD16, peripheral: LPUART2, signal: lpuart_tx, pin_signal: PTA10, identifier: UART2_TX, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
  - {pin_num: AD18, peripheral: LPUART2, signal: lpuart_rx, pin_signal: PTA11, identifier: UART2_RX, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
  - {pin_num: AC19, peripheral: LPUART0, signal: lpuart_tx, pin_signal: PTA18, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
  - {pin_num: AB19, peripheral: LPUART0, signal: lpuart_rx, pin_signal: PTA19, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
  - {pin_num: F17, peripheral: LPUART4, signal: lpuart_tx, pin_signal: PTC2, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
  - {pin_num: G17, peripheral: LPUART4, signal: lpuart_rx, pin_signal: PTC3, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
  - {pin_num: F9, peripheral: LPUART6, signal: lpuart_cts_b, pin_signal: PTE8, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
  - {pin_num: G9, peripheral: LPUART6, signal: lpuart_rts_b, pin_signal: PTE9, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
  - {pin_num: D8, peripheral: LPUART6, signal: lpuart_tx, pin_signal: PTE10, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
  - {pin_num: A8, peripheral: LPUART6, signal: lpuart_rx, pin_signal: PTE11, PE: PE_1_pull_enabled, PS: PS_1_pull_up}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : init_uart_pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void init_uart_pins(void) {                                /*!< Function assigned for the core: Cortex-M4[cm4] */
    IOMUXC_SetPinMux(INIT_UART_PINS_UART2_TX_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_UART_PINS_UART2_TX_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC0_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(INIT_UART_PINS_UART2_RX_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_UART_PINS_UART2_RX_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC0_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(INIT_UART_PINS_UART0_TX_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_UART_PINS_UART0_TX_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC0_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(INIT_UART_PINS_UART0_RX_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_UART_PINS_UART0_RX_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC0_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(INIT_UART_PINS_UART2_CTS_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_UART_PINS_UART2_CTS_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC0_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(INIT_UART_PINS_UART2_RTS_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_UART_PINS_UART2_RTS_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC0_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(INIT_UART_PINS_UART4_TX_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_UART_PINS_UART4_TX_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC1_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(INIT_UART_PINS_UART4_RX_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_UART_PINS_UART4_RX_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC1_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(INIT_UART_PINS_UART6_TX_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_UART_PINS_UART6_TX_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC1_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(INIT_UART_PINS_UART6_RX_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_UART_PINS_UART6_RX_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC1_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(INIT_UART_PINS_UART6_CTS_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_UART_PINS_UART6_CTS_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC1_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(INIT_UART_PINS_UART6_RTS_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_UART_PINS_UART6_RTS_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC1_SW_MUX_CTL_PAD_PS_MASK);
}


