SijWoo/EmbeddedLinux-Guide/pinmux/M4F/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
init_i2c_pins:
- options: {callFromInitBoot: 'false', coreID: cm4}
- pin_list:
  - {pin_num: AG18, peripheral: LPI2C0, signal: lpi2c_scl, pin_signal: PTA16, ODE: ODE_1_Open_drain}
  - {pin_num: AD19, peripheral: LPI2C0, signal: lpi2c_sda, pin_signal: PTA17, ODE: ODE_1_Open_drain}
  - {pin_num: AC8, peripheral: LPI2C3, signal: lpi2c_scl, pin_signal: PTB12, ODE: ODE_1_Open_drain}
  - {pin_num: AD8, peripheral: LPI2C3, signal: lpi2c_sda, pin_signal: PTB13, ODE: ODE_1_Open_drain}
  - {pin_num: F16, peripheral: LPI2C5, signal: lpi2c_scl, pin_signal: PTC4, ODE: ODE_1_Open_drain}
  - {pin_num: D17, peripheral: LPI2C5, signal: lpi2c_sda, pin_signal: PTC5, ODE: ODE_1_Open_drain}
  - {pin_num: H7, peripheral: LPI2C7, signal: lpi2c_scl, pin_signal: PTF12, ODE: ODE_1_Open_drain}
  - {pin_num: H6, peripheral: LPI2C7, signal: lpi2c_sda, pin_signal: PTF13, ODE: ODE_1_Open_drain}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : init_i2c_pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void init_i2c_pins(void) {                                 /*!< Function assigned for the core: Cortex-M4[cm4] */
    IOMUXC_SetPinMux(INIT_I2C_PINS_I2C0_SCL_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2C_PINS_I2C0_SCL_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_ODE_MASK);
    IOMUXC_SetPinMux(INIT_I2C_PINS_I2C0_SDA_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2C_PINS_I2C0_SDA_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_ODE_MASK);
    IOMUXC_SetPinMux(INIT_I2C_PINS_I2C3_SCL_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2C_PINS_I2C3_SCL_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_ODE_MASK);
    IOMUXC_SetPinMux(INIT_I2C_PINS_I2C3_SDA_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2C_PINS_I2C3_SDA_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_ODE_MASK);
    IOMUXC_SetPinMux(INIT_I2C_PINS_I2C5_SCL_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2C_PINS_I2C5_SCL_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_ODE_MASK);
    IOMUXC_SetPinMux(INIT_I2C_PINS_I2C5_SDA_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2C_PINS_I2C5_SDA_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_ODE_MASK);
    IOMUXC_SetPinMux(INIT_I2C_PINS_I2C7_SCL_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2C_PINS_I2C7_SCL_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_ODE_MASK);
    IOMUXC_SetPinMux(INIT_I2C_PINS_I2C7_SDA_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_I2C_PINS_I2C7_SDA_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_ODE_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
init_adc_pins:
- options: {callFromInitBoot: 'false', coreID: cm4}
- pin_list:
  - {pin_num: AD22, peripheral: ADC0, signal: adc_ch10a, pin_signal: PTA20}
  - {pin_num: AB16, peripheral: ADC1, signal: adc_ch5a, pin_signal: PTA8, identifier: ADC1_CH5A}
  - {pin_num: AC16, peripheral: ADC1, signal: adc_ch5b, pin_signal: PTA9, identifier: ADC1_CH5B}
  - {pin_num: AD16, peripheral: ADC1, signal: adc_ch6a, pin_signal: PTA10, identifier: ADC1_CH6A}
  - {pin_num: AD18, peripheral: ADC1, signal: adc_ch6b, pin_signal: PTA11, identifier: ADC1_CH6B}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : init_adc_pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void init_adc_pins(void) {                                 /*!< Function assigned for the core: Cortex-M4[cm4] */
    IOMUXC_SetPinMux(INIT_ADC_PINS_ADC1_CH6A_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_ADC_PINS_ADC1_CH6B_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_ADC_PINS_BATT_ADC_IN_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_ADC_PINS_ADC1_CH5A_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_ADC_PINS_ADC1_CH5B_PIN_FUNCTION_ID, 0U);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
init_ewm_pins:
- options: {callFromInitBoot: 'false', coreID: cm4}
- pin_list:
  - {pin_num: AC20, peripheral: EWM, signal: ewm_out_b, pin_signal: PTA22}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : init_ewm_pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void init_ewm_pins(void) {                                 /*!< Function assigned for the core: Cortex-M4[cm4] */
    IOMUXC_SetPinMux(INIT_EWM_PINS_EWM_OUT_B_PIN_FUNCTION_ID, 0U);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
init_sjc_pins:
- options: {callFromInitBoot: 'false', coreID: cm4}
- pin_list:
  - {pin_num: AF21, peripheral: JTAG, signal: jtag_tms, pin_signal: PTA26, identifier: JTAG_TMS}
  - {pin_num: AF22, peripheral: JTAG, signal: jtag_tdo, pin_signal: PTA27}
  - {pin_num: AG22, peripheral: JTAG, signal: jtag_tdi, pin_signal: PTA28}
  - {pin_num: AD23, peripheral: JTAG, signal: jtag_tclk, pin_signal: PTA29, identifier: JTAG_TCLK}
  - {pin_num: AD24, peripheral: JTAG, signal: jtag_trst_b, pin_signal: PTA30}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

