SijWoo/EmbeddedLinux-Guide/pinmux/M4F/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : init_sjc_pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void init_sjc_pins(void) {                                 /*!< Function assigned for the core: Cortex-M4[cm4] */
    IOMUXC_SetPinMux(INIT_SJC_PINS_JTAG_TMS_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_SJC_PINS_JTAG_TMS_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC0_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(INIT_SJC_PINS_JTAG_TDO_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SJC_PINS_JTAG_TDI_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_SJC_PINS_JTAG_TDI_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC0_SW_MUX_CTL_PAD_PS_MASK);
    IOMUXC_SetPinMux(INIT_SJC_PINS_JTAG_TCLK_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_SJC_PINS_JTAG_TCLK_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(INIT_SJC_PINS_JTAG_TRST_B_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_SJC_PINS_JTAG_TRST_B_PIN_FUNCTION_ID,
                        IOMUXC0_SW_MUX_CTL_PAD_PE_MASK |
                        IOMUXC0_SW_MUX_CTL_PAD_PS_MASK);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
init_qspi_pins:
- options: {callFromInitBoot: 'false', coreID: cm4}
- pin_list:
  - {pin_num: AG6, peripheral: QSPIA, signal: 'qspia_ss_b, 0', pin_signal: PTB8}
  - {pin_num: AF8, peripheral: QSPIA, signal: qspia_sclk, pin_signal: PTB15}
  - {pin_num: AF9, peripheral: QSPIA, signal: 'qspia_data, 3', pin_signal: PTB16}
  - {pin_num: AF10, peripheral: QSPIA, signal: 'qspia_data, 2', pin_signal: PTB17}
  - {pin_num: AG10, peripheral: QSPIA, signal: 'qspia_data, 1', pin_signal: PTB18}
  - {pin_num: AD10, peripheral: QSPIA, signal: 'qspia_data, 0', pin_signal: PTB19}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : init_qspi_pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void init_qspi_pins(void) {                                /*!< Function assigned for the core: Cortex-M4[cm4] */
    IOMUXC_SetPinMux(INIT_QSPI_PINS_QSPIA_SCLK_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_QSPI_PINS_QSPIA_DATA3_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_QSPI_PINS_QSPIA_DATA2_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_QSPI_PINS_QSPIA_DATA1_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_QSPI_PINS_QSPIA_DATA0_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_QSPI_PINS_QSPIA_SS0_B_PIN_FUNCTION_ID, 0U);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
init_rtc_pins:
- options: {callFromInitBoot: 'false', coreID: cm4}
- pin_list:
  - {pin_num: AG8, peripheral: RTC, signal: rtc_clkout, pin_signal: PTB14}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : init_rtc_pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void init_rtc_pins(void) {                                 /*!< Function assigned for the core: Cortex-M4[cm4] */
    IOMUXC_SetPinMux(INIT_RTC_PINS_RTC_CLK_PIN_FUNCTION_ID, 0U);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
init_usb_pins:
- options: {callFromInitBoot: 'false', coreID: cm4}
- pin_list:
  - {pin_num: D13, peripheral: USB0, signal: usb0_id, pin_signal: PTC13}
  - {pin_num: G13, peripheral: USB1, signal: 'usb1_oc, 2', pin_signal: PTC16}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : init_usb_pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void init_usb_pins(void) {                                 /*!< Function assigned for the core: Cortex-M4[cm4] */
    IOMUXC_SetPinMux(INIT_USB_PINS_USB_OTG_ID_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_USB_PINS_USB_OTG_OC_PIN_FUNCTION_ID, 0U);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
init_sdhc_pins:
- options: {callFromInitBoot: 'false', coreID: cm4}
- pin_list:
  - {pin_num: A24, peripheral: SDHC0, signal: sdhc_reset_b, pin_signal: PTD0}
  - {pin_num: B24, peripheral: SDHC0, signal: sdhc_cmd, pin_signal: PTD1}
  - {pin_num: B23, peripheral: SDHC0, signal: sdhc_clk, pin_signal: PTD2, IBE: IBE_1_Enabled}
  - {pin_num: B22, peripheral: SDHC0, signal: 'sdhc_d, 7', pin_signal: PTD3}
  - {pin_num: A22, peripheral: SDHC0, signal: 'sdhc_d, 6', pin_signal: PTD4}
  - {pin_num: D21, peripheral: SDHC0, signal: 'sdhc_d, 5', pin_signal: PTD5}
  - {pin_num: D22, peripheral: SDHC0, signal: 'sdhc_d, 4', pin_signal: PTD6}
  - {pin_num: A20, peripheral: SDHC0, signal: 'sdhc_d, 3', pin_signal: PTD7}
  - {pin_num: B20, peripheral: SDHC0, signal: 'sdhc_d, 2', pin_signal: PTD8}
  - {pin_num: B19, peripheral: SDHC0, signal: 'sdhc_d, 1', pin_signal: PTD9}
  - {pin_num: B18, peripheral: SDHC0, signal: 'sdhc_d, 0', pin_signal: PTD10}
  - {pin_num: A18, peripheral: SDHC0, signal: sdhc_dqs, pin_signal: PTD11}
  - {pin_num: D12, peripheral: SDHC1, signal: 'sdhc_d, 1', pin_signal: PTE0}
  - {pin_num: A12, peripheral: SDHC1, signal: 'sdhc_d, 0', pin_signal: PTE1}
  - {pin_num: B12, peripheral: SDHC1, signal: sdhc_clk, pin_signal: PTE2, IBE: IBE_1_Enabled}
  - {pin_num: B11, peripheral: SDHC1, signal: sdhc_cmd, pin_signal: PTE3}
  - {pin_num: B10, peripheral: SDHC1, signal: 'sdhc_d, 3', pin_signal: PTE4}
  - {pin_num: A10, peripheral: SDHC1, signal: 'sdhc_d, 2', pin_signal: PTE5}
  - {pin_num: B6, peripheral: SDHC1, signal: sdhc_vs, pin_signal: PTE14}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

