SijWoo/EmbeddedLinux-Guide/pinmux/M4F/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : init_sdhc_pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void init_sdhc_pins(void) {                                /*!< Function assigned for the core: Cortex-M4[cm4] */
    IOMUXC_SetPinMux(INIT_SDHC_PINS_SD0_nRST_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_SD0_CMD_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_SD0_DATA0_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_SD0_DQS_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_SD0_CLK_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_SDHC_PINS_SD0_CLK_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_IBE_MASK);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_SD0_DATA7_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_SD0_DATA6_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_SD0_DATA5_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_SD0_DATA4_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_SD0_DATA3_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_SD0_DATA2_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_SD0_DATA1_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_WL_SD1_DATA1_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_WL_SD1_DATA0_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_SD1_VSEL_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_WL_SD1_CLK_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinConfig(INIT_SDHC_PINS_WL_SD1_CLK_PIN_FUNCTION_ID,
                        IOMUXC1_SW_MUX_CTL_PAD_IBE_MASK);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_WL_SD1_CMD_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_WL_SD1_DATA3_PIN_FUNCTION_ID, 0U);
    IOMUXC_SetPinMux(INIT_SDHC_PINS_WL_SD1_DATA2_PIN_FUNCTION_ID, 0U);
}


/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
init_tpm_pins:
- options: {callFromInitBoot: 'false', coreID: cm4}
- pin_list:
  - {pin_num: B3, peripheral: TPM4, signal: 'tpm_ch, 1', pin_signal: PTF2}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : init_tpm_pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void init_tpm_pins(void) {                                 /*!< Function assigned for the core: Cortex-M4[cm4] */
    IOMUXC_SetPinMux(INIT_TPM_PINS_LED_PWM_EN_PIN_FUNCTION_ID, 0U);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
